{
  "folders": [
    {
      "id": "Banking",
      "name": "Banking",
      "articles": [
        {
          "id": "banking-article-01",
          "headline": "Easy Online Banking",
          "subHeadline": "It's has never been so easy",
          "content": "Whether you are using Afterwards for personal use, freelancer or managing a small business. Banking is important part of everyones life",
          "author": "Afterwards",
          "written": "January 15th, 2024"
        },
      ]
    },
    {
      "id": "Business",
      "name": "Business",
      "articles": [
        {
          "id": "business-article-01",
          "headline": "Get Your Employer Identification Number (EIN)",
          "subHeadline": "It's easy and free!",
          "content": "First what is a Employer Idetification Number also known as a EIN? Think of it as a Social Security Number (SSN) for business. This helps the IRS keep track of companys earnings and payments to employees.\n\nNow you are wondering do I actually need this? If you are the only one working in your business, no you don't need one but some bank require you get one.",
          "author": "Afterwards",
          "written": "January 15th, 2024"
        },
      ]
    },
    {
      "id": "Retirement",
      "name": "Retirement",
      "articles": [
        {
          "id": "retirement-article-01",
          "headline": "Maximizing Your 401(k) for Retirement Savings",
          "subHeadline": "Smart Strategies for Future Financial Security",
          "content": "A 401(k) plan is not just a retirement savings tool; it's a crucial element of your financial planning. Contributing to a 401(k) offers immediate tax relief by reducing your taxable income. The 2024 contribution limit is $23,000, with an additional $7,000 allowed for those over 50. Furthermore, many employers match a portion of your contributions, essentially offering free money towards your retirement. It's vital to understand the types of 401(k)s - traditional and Roth - each with unique tax implications. Traditional 401(k)s offer tax-deferred growth, meaning you'll pay taxes upon withdrawal, while Roth 401(k)s are funded with after-tax dollars, offering tax-free growth and withdrawals. Strategic planning around your 401(k) can significantly impact your retirement readiness, particularly when it comes to deciding when and how to withdraw funds to minimize tax liabilities.\n\nRemember, withdrawing before age 59½ typically incurs a 10% penalty, so plan your retirement distributions carefully.\n\n Afterwards and it's developers are not tax experts. Always consult a professional.",
          "author": "Afterwards",
          "written": "January 16th, 2024"
        }
      ]
    },
    {
      "id": "Tax",
      "name": "Tax",
      "articles": [
        {
          "id": "tax-article-01",
          "headline": "Navigating Tax Returns: A Comprehensive Guide",
          "subHeadline": "Making Tax Season Less Daunting",
          "content": "Filing tax returns is a fundamental responsibility for individuals and businesses alike. The process involves reporting your income, deductions, and credits to calculate your tax liability. Understanding the nuances of tax filing starts with knowing your filing status, which affects your standard deduction and tax rates. Common statuses include Single, Married Filing Jointly, and Head of Household. Deductions lower your taxable income, with options for itemized or standard deductions. Itemized deductions include mortgage interest, state taxes, and charitable contributions, while the standard deduction for 2024 is set at $12,950 for single filers. Tax credits, such as the Earned Income Tax Credit or Child Tax Credit, are powerful tools as they directly reduce your tax bill dollar for dollar. Reporting accurate income, from employment, investments, or businesses, is crucial. For those with more complex situations, such as self-employment or multiple income sources, understanding additional forms and schedules is key. Always keep abreast of the latest tax law changes to maximize your return and maintain compliance.\n\nRemember, timely filing and accurate reporting are essential to avoid penalties and audits.\n\n Afterwards and it's developers are not tax experts. Always consult a professional.",
          "author": "Afterwards",
          "written": "January 16th, 2024"
        }
      ]
    },
  ]
}
